app/controllers/accounts_controller.rb

SELECT  "accounts".* FROM "accounts" WHERE "accounts"."user_id" IS NULL  ORDER BY "accounts"."id" DESC LIMIT 5
---
  def index
    @accounts = Account.where(user: current_user).last(5)

INSERT INTO "accounts" ("kind", "cost", "time", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["kind", "home"], ["cost", 100], ["time", "2015-05-14 03:20:00.000000"], ["user_id", 3], ["created_at", "2015-05-14 03:20:47.559027"], ["updated_at", "2015-05-14 03:20:47.559027"]]
---
  def create
    @account = Account.new(account_params)
    @account.user_id=current_user.id
    respond_to do |format|
      if @account.save

UPDATE "accounts" SET "kind" = ?, "updated_at" = ? WHERE "accounts"."id" = ?  [["kind", "car"], ["updated_at", "2015-05-13 15:53:57.999562"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @account.update(account_params)